{"keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "BatchNormalization", "config": {"scale": true, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "center": true, "dtype": "float32", "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "batch_input_shape": [null, 1, 40, 50, 50], "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_size": [3, 3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null, "name": "conv3d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "padding": "same", "filters": 32, "strides": [1, 1, 1], "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"padding": "same", "strides": [3, 3, 3], "trainable": true, "data_format": "channels_first", "name": "max_pooling3d_4", "pool_size": [3, 3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_6", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": 1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_size": [3, 3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null, "name": "conv3d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "padding": "same", "filters": 64, "strides": [1, 1, 1], "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"padding": "same", "strides": [3, 3, 3], "trainable": true, "data_format": "channels_first", "name": "max_pooling3d_5", "pool_size": [3, 3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_7", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": 1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "name": "dropout_5", "noise_shape": null, "trainable": true}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_size": [3, 3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null, "name": "conv3d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "padding": "same", "filters": 128, "strides": [1, 1, 1], "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"padding": "same", "strides": [3, 3, 3], "trainable": true, "data_format": "channels_first", "name": "max_pooling3d_6", "pool_size": [3, 3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_8", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": 1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "name": "dropout_6", "noise_shape": null, "trainable": true}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_size": [3, 3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null, "name": "conv3d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "padding": "same", "filters": 256, "strides": [1, 1, 1], "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"padding": "same", "strides": [3, 3, 3], "trainable": true, "data_format": "channels_first", "name": "max_pooling3d_7", "pool_size": [3, 3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_9", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": 1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "name": "dropout_7", "noise_shape": null, "trainable": true}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_size": [3, 3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null, "name": "conv3d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "padding": "same", "filters": 512, "strides": [1, 1, 1], "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"padding": "same", "strides": [3, 3, 3], "trainable": true, "data_format": "channels_first", "name": "max_pooling3d_8", "pool_size": [3, 3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_10", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": 1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "name": "dropout_8", "noise_shape": null, "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "use_bias": true, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "units": 1024, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "name": "dropout_9", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "use_bias": true, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_constraint": null, "units": 2, "activity_regularizer": null, "bias_constraint": null}}]}